$(document).ready(function () {
	$('#wrapper').html(' <div id="wrapMenu"> <img src="images/menu.png" width="35"> <br> <div id="textMenu"> <div id="versionCode"> Выбрать версию шифра: <br> <br> <div class="classVers" id="versionOne"> Версия #1 </div> <div class="classVers" id="versionTwo"> Версия #2 </div> <div class="classVers" id="versionThree"> Версия #3 </div> <div class="classVers" id="versionFour"> Версия #4 </div> <div id="more"> еще </div> <div class="moreVersion" id="versionFive"> Версия #5 </div> <div class="moreVersion" id="versionSix"> Версия #6 </div> <div class="moreVersion" id="versionSeven"> Версия #7 </div> <div class="moreVersion" id="versionEight"> Версия #8 </div> </div> </div> </div> <div class="category" id="coder">шифратор</div> <div class="category" id="deCoder">дешифратор</div><div id="shellTextarea"><textarea class="textArr" id="text" placeholder="текст"> </textarea><textarea class="textArr" id="code" placeholder="шифр"></textarea></div><div class="btn" id="btnCode"> зашифровать </div><div class="btn" id="btndeCode"> дешифровать </div> <a id="link" target="_blank" href="http://vk.com/encoder_chrome"> vk.com/encoder_chrome </a>');

	$("#coder").addClass("categoryFocus");	
	$("#textMenu").css({"display": "none"});

var latin = ["а", "б", "в", "г", "д", "е", 
			"ё", "ж", "з", "и", "й", "к", "л",  
			"м", "н", "о", "п", "р", "с", "т", 
			"у", "ф", "х", "ц", "ч", "ш","щ","ъ",
			"ы","ь","э","ю","я",".",",","?"," ",
			"1","2","3","4","5","6","7","8","9","0",
			"А", "Б", "В", "Г", "Д", "Е", 
			"Ё", "Ж", "З", "И", "Й", "К", "Л",  
			"М", "Н", "О", "П", "Р", "С", "Т", 
			"У", "Ф", "Х", "Ц", "Ч", "Ш","Щ","Ъ",
			"Ы","Ь","Э","Ю","Я", "a", "b", "c", "d", "e", "f", 
			"g", "h", "i", "j", "k", "l", "m",  
			"n", "o", "p", "q", "r", "s", "t", 
			"u", "v", "w", "x", "y", "z","/",":",
			"A", "B", "C", "D", "E", "F", 
			"G", "H", "I", "J", "K", "L", "M",  
			"N", "O", "P", "Q", "R", "S", "T", 
			"U", "V", "W", "X", "Y", "Z"];

var code = ["$", ")", "!", "'", ">", "=", 
			"%", "(", "`", "]", "<", "-", "♂", 
			"^", "}", "/", "_", "@", "♀", "☻", 
			"*", "&", "☭", "?", "+", "☯","☓","☑",
			"☏","☎","q","n","i","m","w","g","|",
			"➲","↓","✽","✿","❂","❆","♓","♋","❇","❅",
			"Á", "Æ", "Ç", "È", "✐", "✑", 
			"✒", "✖", "✗", "✪", "✫", "✬", "✯",  
			"✰", "✍", "✆", "✄", "✂", "❥", "❍", 
			"❒", "™", "‰", "†", "‡", "…","ω","ψ",
			"σ","ς","θ","η","ζ","♔", "♕", "♖", "♗", "♘", "♙", 
			"♚", "♛", "♜", "♝", "♞", "♟", "☍",  
			"☌", "☋", "☊", "☾", "☽", "☷", "☶", 
			"☵", "☴", "☳", "☲", "☱", "☰","⁾","⁻",
			"├", "¼", "½", "¬", "⌐", "¿", 
			"Ñ", "ñ", "₧", "¥", "£", "¢", "ÿ",  
			"€", "■", "√", "இ", "〄", "☠", "Џ", 
			"Գ", "☄", "ッ", "█", "∞", "∑"];	

var codeA = ["✪", "✂", "❍", "✖", "+", "✰", "✆", 
			 "-", "♋", "%", "✯", "/", "=", "!", "✬", 
			 "w", "æ", ")", "^", "✍", "❒", "☻", "á", "`", 
			 "è", "☭", "✄", "_", "☓", "'", "i", "…", 
			 "✽", "‡", "‰", "✫", "↓", "☑", "☎", "♀", "]", 
			 "✿", "†", "|", "q", "♓", "ç", "♂", "(", "❂", 
			 "™", "n", "☯", "➲", "✒", "❅", "✑", "}", "$", 
			 "@", "❥", "❇", "?", "<", ">", "g", "❆", "&", 
			 "m", "✗", "✐", "☏", "*", "ω", "ψ", "σ", "ς", 
			 "θ", "η", "ζ", "♔", "♕", "♖", "♗", "♘", "♙", 
			 "♚", "♛", "♜", "♝", "♞", "♟", "☍", "☌", 
			 "☋", "☊", "☾", "☽", "☷", "☶", "☵", "☴",
			  "☳", "☲", "☱", "☰", "⁾", "⁻", "├", "¼", "½", 
			  "¬", "⌐", "¿", "Ñ", "ñ", "₧", "¥", "£", "¢", "ÿ", 
			  "€", "■", "√", "இ", "〄", "☠", "Џ", "Գ", "☄", 
			  "ッ", "█", "∞", "∑"]

var codeB = ["(", "✄", "☴", "♞", "ñ", "*", "♜", "i", "█", 
			 "☏", "♖", "g", "á", "₧", "☯", "♗", "✐", "♚", 
			 "♘", "♙", "£", "☾", "✗", "☳", "?", "]", 
			 "<", "‡", "q", "✑", "✆", "☄", "✒", "'", "❇", 
			 "☽", "…", "σ", "æ", "ç", "ÿ", "¢", "|", "☊", 
			 "/", "&", "❍", "❂", "џ", "✰", "գ", "இ", "=", 
			 "├", "☵", "♓", "∞", "-", "♀", "☻", "ψ", "ñ", 
			 "☠", "☎", "∑", "♕", "■", "ς", "ζ", "✂", "$", 
			 "❆", ">", "☓", "☌", "⌐", "@", "☍", "✬", "ω", 
			 "❅", "✿", "½", "¼", "☱", "!", "✽", "♂", "✫", 
			 "è", "n", "¿", "‰", "⁻", "☲", "†", "☭", 
			 "〄", "+", "⁾", "ッ", "❥", "}", "¥", "^", 
			 "✯", "♔", "m", "w", "¬", "♟", "☑", "➲", 
			 "`", "☶", "√", "♋", "☰", "☋", "❒", "☷", 
			 "€", "✪", ")", "_", "♝", "✍", "✖", "%", "η", 
			 "♛", "↓", "™", "θ"];	

var codeC = ["✰", "'", "♘", "(", "♙", "¿", "✆", "η", "☊", 
			 "☳", "<", ")", "q", "☓", "√", "♖", ">", "/", "&", "½", 
			 "∑", "ñ", "☾", "☶", "!", "*", "❅", "☷", "☠", "☑", 
			 "¼", "¬", "ÿ", "↓", "〄", "¢", "♀", "ψ", "☰", "i", "ζ", 
			 "♕", "✬", "✗", "☯", "✒", "❆", "❂", "?", "$", "☲",
			 "☌", "ç", "♋", "⌐", "θ", "∞", "☎", "-", "✖", 
			 "ω", "☱", "✯", "☻", "}", "ς", "ッ", "á", "✍", "m",
			 "✽", "✐", "♓", "☭", "✂", "✑", "➲", "‰", "=", 
			 "џ", "♞", "♔", "☍", "☏", "†", "⁾", "w", "♟", 
			 "☽", "✫", "ñ", "%", "█", "g", "❍", "è", "❥", "♂", 
			 "£", "@", "├", "+", "¥", "☋", "♚", "☴", "❒", "☄", 
			 "♜", "]", "■", "♗", "_", "™", "⁻", "இ", "σ", "♝", 
			 "^", "`", "|", "‡", "❇", "☵", "♛", "…", "æ", "✄", 
			 "n", "₧", "✿", "գ", "✪", "€"];

var codeD = ["⁻", "ç", "✑", "n", "♟", "✄", "☱", "♂", 
			 "☯", "♙", "☏", "è", "ñ", "‰", "ッ", ")", "✖", 
			 "❍", "☍", "✂", "☊", "☓", "☭", "?", "☄", "♖", 
			 "⌐", "♓", "☌", "✽", "✗", "♜", "g", "♞", "❒", "■", 
			 "w", "¢", "@", "♕", "q", "^", "✯", "⁾", "✆", "+", "∞", 
			 "¼", "↓", "=", "∑", "<", "☎", "♝", "☋", "…", "█", 
			 "ÿ", "〄", "ς", "☵", "☲", "☑", "♘", "☽", "$", 
			 "&", "|", "_", "`", "✫", "➲", "✐", "գ", "☠", 
			 "æ", "✪", "'", "½", "¬", "♋", "/", "¿", "├", 
			 "☰", "-", "ζ", "☾", "£", "♔", "❅", "✰", 
			 "σ", "✿", "™", "ω", "ψ", "☻", "☶", "‡", 
			 "❆", "η", "á", "(", "i", "¥", "†", "}", 
			 "✒", "♚", "₧", "☳", "♀", "♛", "இ", 
			 "*", "θ", "!", "❂", "☷", "€", "]", 
			 "ñ", "џ", "♗", "❥", ">", "%", "☴", "√", 
			 "m", "❇", "✍", "✬"];

var codeE = ["☏", "☵", "ñ", "♞", "✒", "}", "✄", "æ", 
			 "$", "θ", "☊", "♘", "✰", "❆", "!", "w", 
			 "¢", "@", "¥", "|", "☴", "i", "%", ">", "♓", 
			 "✽", "☎", "g", "█", "‰", "☄", "⁻", "∞", "?", 
			 "♛", "✯", "✂", "™", "á", "✐", "(", "џ", "✍", 
			 "♂", "`", "❒", "✗", "σ", "è", "☲", "☑", 
			 "-", "இ", "☾", "†", "❍", "η", ")", "☷", 
			 "♙", "^", "♗", "☋", "♝", "_", 
			 "❇", "☠", "ッ", "♚", "=", "✖", "├", "⌐", 
			 "+", "ÿ", "♕", "¬", "ω", "☱", "♔", "☓", 
			 "✪", "☻", "ψ", "£", "ñ", "գ", "'", "‡", "¼", 
			 "☳", "ς", "]", "☽", "✿", "½", "❅", "⁾", "➲", 
			 "¿", "ζ", "♋", "✆", "✫", "…", "↓", "♜", 
			 "m", "〄", "☯", "<", "■", "&", "∑", "♖", 
			 "✑", "♀", "☰", "❂", "₧", "☭", "♟", 
			 "ç", "√", "✬", "❥", "☌", "*", "/", "€", 
			 "☍", "q", "☶", "n"];

var codeF = ["∞", "^", "✖", "á", "☊", "½", "+", 
			 "☍", "∑", "ÿ", "✆", "†", ">", "↓", 
			 "♖", "❇", "♕", "ς", "¬", "✂", "☳", 
			 "✫", "♂", "%", "├", "✬", "☷", "♜", "?", 
			 "<", "█", "☄", "♋", "¿", "✄", "|", "☶", 
			 "♔", "⁻", "☭", "ñ", "i", "✿", "✑", 
			 "ζ", "η", "‰", "¥", "m", "√", "✯", "w", 
			 "ッ", "〄", "q", "⁾", "ç", "☻", "@", "(", "♙", 
			 "✐", "-", "_", "™", "æ", "/", "☾", "❒", 
			 "✗", "‡", "☽", "θ", "♛", "}", "❍", "☎", 
			 "☱", "£", "¼", "☏", "*", "♗", "]", 
			 "■", "♀", "❅", "ñ", "♟", "☌", "♚", 
			 "'", "✪", "❂", "!", "$", "ψ", "♓", "✰", "➲", 
			 "=", "…", "❆", "♝", "☰", "✒", "♞", 
			 "✽", "g", "இ", "☵", "⌐", "☑", "☴", 
			 "❥", "n", "&", "`", "☋", "¢", "☲", "✍", 
			 ")", "σ", "♘", "ω", "џ", "գ", "è", 
			 "₧", "☠", "☯", "☓", "€"];

var codeG = ["❥", "₧", "‡", "♓", "〄", "➲", 
			 ">", "@", "├", "♟", "á", "☾", "գ", "☎", 
			 "✒", "¬", "♂", "☳", "↓", "&", "☌", 
			 "¢", "w", "❍", "✖", "€", "q", "✯", "ñ", 
			 "†", "£", "☴", "‰", "♙", "✑", "❂", "g", 
			 "☯", "☻", "♜", "☱", "இ", "!", "✬", 
			 "☶", "n", "✐", "ω", "☵", ")", "☠", 
			 "^", "♚", "♝", "☋", "æ", "/", "♋", "¼", 
			 "■", "✿", "█", "♛", "½", "¥", "✽", "ñ", 
			 "è", "σ", "☭", "ÿ", "⁾", "<", "√", "∑", "☊", "?", "ッ", 
			 "♔", "♞", "☄", "☏", "™", "☓", "]", 
			 "☷", "ζ", "ç", "`", "θ", "♘", "}", "$", "_", 
			 "ς", "m", "-", "|", "✫", "✆", "¿", "η", "♗", 
			 "…", "(", "♖", "✍", "*", "❇", "✪", "i", "✰", 
			 	"☑", "♀", "❅", "џ", "❒", "=", "ψ", "⌐", 
			 "☲", "∞", "❆", "♕", "%", "✗", "☽", "✄", "+", 
			 "☰", "⁻", "✂", "☍", "'"];

var codeH = ["ñ", "$", "=", "✿", "☲", "♋", "g", "☭", 
			 "₧", "¥", "σ", "ÿ", "♞", "↓", ">", "☾", 
			 "☽", "∑", "❒", "✄", "ñ", "☌", "գ", "✐", "q", 
			 "♂", "☎", "ω", "n", "(", "♚", "⁻", 
			 "இ", "€", "♟", "☯", "♝", "‡", "…", "✑", 
			 "☑", "è", "‰", "@", "£", "♓", "☋", "☍", 
			 "½", "☰", "?", "m", "✍", "ψ", "]", "i", "✒", 
			 ")", "♛", "✂", "♕", "✬", "⁾", "☊", "'", 
			 "❆", "+", "■", "█", "☠", "w", "☴", "♙", "&", 
			 "❅", "❂", "✗", "➲", "☏", "❇", "☱", "√", "✽", 
			 "├", "θ", "^", "`", "☄", "♀", "æ", "☳", 
			 "☷", "∞", "✆", "¿", "á", "ς", "✪", "%", 
			 "✫", "✯", "*", "™", "❍", "✰", "}", "☻", "/", 
			 "♔", "♗", "<", "♜", "η", "|", "☶", "!", 
			 "¬", "❥", "ッ", "_", "ζ", "-", "♘", "ç", "¼", 
			 "☵", "✖", "☓", "џ", "⌐", "¢", "〄", "♖", "†"];


$("#btnCode").click(function(){
	$('#code').empty();
	var textArea = $("#text").val(); 
	var newArr = []; 
	for(var i = 0; i <= textArea.length; i++){ 
		for (var j = 0; j <= latin.length; j++){ 
			if(textArea.charAt(i) == latin[j]){ 
				var endText = latin.indexOf(latin[j]); 
				newArr.push(endText); 
			}
		}
	}
		 for(var l = 0; l <= newArr.length; l++){
		 	$("#code").append(code[newArr[l]]); 
		 };

}); // http://abak.pozitiv-r.ru <div id="testBtn"> test </div> <div id="testBtn2"> test2 </div>

$("#btndeCode").click(function(){
	$('#text').empty();
	var textArea = $("#code").val(); 
	var newArr = []; 
	for(var i = 0; i <= textArea.length; i++){ 
		for (var j = 0; j <= code.length; j++){ 
			if(textArea.charAt(i) == code[j]){ 
				var endText = code.indexOf(code[j]); 
				newArr.push(endText); 
			}
		}
	}
		 for(var l = 0; l <= newArr.length; l++){
		 	$("#text").append(latin[newArr[l]]); 
		 };

});

$("#versionOne").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeA[u];
			//console.log(code[u]); 
		}
	// var str = "&❅❂✗➲☏❇☱√✽├θ^`☄♀æ☳☷∞✆¿áς✪%✫✯*™❍✰}☻/♔♗<♜η|☶!¬❥ッ_ζ-♘ç¼☵✖☓џ⌐¢〄♖†";
	// console.log(str.split(''));
	// console.log(code.join(''));   // 1-2-3-4
});

$("#versionTwo").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeB[u];
		}
});
$("#versionThree").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeC[u];
		}
});
$("#versionFour").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeD[u];
		}
});
$("#versionFive").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeE[u];
		}
});
$("#versionSix").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeF[u];
		}
});
$("#versionSeven").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeG[u];
		}
});
$("#versionEight").click(function () {
		for (var u = 0; u < code.length; u++) {
			code[u] = codeH[u];
		}
});

$("#coder").click(function(){
	$(".textArr").remove();
	activeCoder ();
	$("#btndeCode").css({"display": "none"});
	$("#btnCode").css({"display": "block"});
	$("#shellTextarea").append('<textarea class="textArr" id="text" placeholder="текст"></textarea> <textarea class="textArr" id="code" placeholder="шифр"></textarea>');
})

$("#deCoder").click(function(){
	$(".textArr").remove();
	activeDecoder ();
	$("#btnCode").css({"display": "none"});
	$("#btndeCode").css({"display": "block"});
	$("#shellTextarea").append('<textarea class="textArr" id="code" placeholder="шифр"></textarea> <textarea class="textArr" id="text" placeholder="текст"></textarea>');
})

function activeCoder (){
	$("#coder").addClass("categoryFocus");
	$("#deCoder").removeClass("categoryFocus");
}
function activeDecoder (){
	$("#deCoder").addClass("categoryFocus");
	$("#coder").removeClass("categoryFocus");
}	

  $("#wrapMenu").toggle(function() { 
		$(this).animate({"height": "250px"}, 500);
		$("#textMenu").css({"display": "block"});
      },  
      function() { 
		$(this).animate({"height": "35px"}, 500);
		$("#textMenu").css({"display": "none"});
		$("body").css({"height": "200px"});
		$(".moreVersion").css({"display": "none"});
      });

 $("#more").hover(function () {
 	$(".moreVersion").css({"display": "block"});
 	$("#wrapMenu").animate({"height": "270px"}, 300);
 });

 $(".moreVersion").click(function () {
 	$(".moreVersion").css({"display": "none"});
 	$(this).css({"color": "black"});
 });
});